#include "psdaq/hsd/Module.hh"

#include "psdaq/mmhw/AxiVersion.hh"
#include "psdaq/mmhw/RegProxy.hh"
#include "psdaq/hsd/TprCore.hh"
#include "psdaq/hsd/RxDesc.hh"
#include "psdaq/hsd/ClkSynth.hh"
#include "psdaq/hsd/Mmcm.hh"
#include "psdaq/hsd/DmaCore.hh"
#include "psdaq/hsd/PhyCore.hh"
#include "psdaq/hsd/Pgp2b.hh"
#include "psdaq/mmhw/Pgp2bAxi.hh"
#include "psdaq/hsd/Pgp3.hh"
#include "psdaq/mmhw/Pgp3Axil.hh"
#include "psdaq/mmhw/RingBuffer.hh"
#include "psdaq/mmhw/Xvc.hh"
#include "psdaq/hsd/I2cSwitch.hh"
#include "psdaq/hsd/LocalCpld.hh"
#include "psdaq/hsd/FmcSpi.hh"
#include "psdaq/hsd/QABase.hh"
#include "psdaq/hsd/Adt7411.hh"
#include "psdaq/hsd/Tps2481.hh"
#include "psdaq/hsd/AdcCore.hh"
#include "psdaq/hsd/AdcSync.hh"
#include "psdaq/hsd/FmcCore.hh"
#include "psdaq/hsd/FmcCoreVoid.hh"
#include "psdaq/hsd/FexCfg.hh"
#include "psdaq/hsd/HdrFifo.hh"
#include "psdaq/hsd/PhaseMsmt.hh"
#include "psdaq/hsd/FlashController.hh"

using Pds::Mmhw::AxiVersion;
using Pds::Mmhw::Pgp2bAxi;
using Pds::Mmhw::Pgp3Axil;
using Pds::Mmhw::RingBuffer;

#include <string>
#include <unistd.h>
#include <stdio.h>
#include <fcntl.h>
#include <netdb.h>
#include <arpa/inet.h>
#include <sys/mman.h>
#include <poll.h>
#include <string.h>

using std::string;

#define GUARD(f) { _sem_i2c.take(); f; _sem_i2c.give(); }

namespace Pds {
  namespace HSD {
    class Module::PrivateData {
    public:
      //  Initialize busses
      void init();

      //  Initialize clock tree and IO training
      void fmc_init(TimingType);

      int  train_io(unsigned);

      void enable_test_pattern(TestPattern);
      void disable_test_pattern();
      void enable_cal ();
      void disable_cal();
      void setAdcMux(bool     interleave,
                     unsigned channels);

      void setRxAlignTarget(unsigned);
      void setRxResetLength(unsigned);
      void dumpRxAlign     () const;
      void dumpPgp         () const;
      //
      //  Low level API
      //
    public:
      AxiVersion version;
      uint32_t rsvd_to_0x08000[(0x8000-sizeof(AxiVersion))/4];

      FlashController      flash;
      uint32_t rsvd_to_0x10000[(0x8000-sizeof(FlashController))/4];

      I2cSwitch i2c_sw_control;  // 0x10000
      ClkSynth  clksynth;        // 0x10400
      LocalCpld local_cpld;      // 0x10800
      Adt7411   vtmon1;          // 0x10C00
      Adt7411   vtmon2;          // 0x11000
      Adt7411   vtmon3;          // 0x11400
      Tps2481   imona;           // 0x11800
      Tps2481   imonb;           // 0x11C00
      Adt7411   vtmona;          // 0x12000
      FmcSpi    fmc_spi;         // 0x12400
      uint32_t  eeprom[0x100];   // 0x12800
      uint32_t  rsvd_to_0x18000[(0x08000-13*0x400)/4];
      uint32_t  regProxy[(0x08000)/4];

      // DMA
      DmaCore           dma_core; // 0x20000
      uint32_t rsvd_to_0x30000[(0x10000-sizeof(DmaCore))/4];

      // PHY
      PhyCore           phy_core; // 0x30000
      uint32_t rsvd_to_0x31000[(0x1000-sizeof(PhyCore))/4];

      // GTH
      uint32_t gthAlign[10];     // 0x31000
      uint32_t rsvd_to_0x31100  [54];
      uint32_t gthAlignTarget;
      uint32_t gthAlignLast;
      uint32_t rsvd_to_0x32000[(0x1000-0x108)/4];

      // XVC
      Pds::Mmhw::Jtag    xvc;
      uint32_t rsvd_to_0x40000[(0xE000-sizeof(xvc))/4];

      // Timing
      Pds::HSD::TprCore  tpr;     // 0x40000
      uint32_t rsvd_to_0x50000  [(0x10000-sizeof(Pds::HSD::TprCore))/4];

      RingBuffer         ring0;   // 0x50000
      uint32_t rsvd_to_0x60000  [(0x10000-sizeof(RingBuffer))/4];

      RingBuffer         ring1;   // 0x60000
      uint32_t rsvd_to_0x70000  [(0x10000-sizeof(RingBuffer))/4];
      uint32_t rsvd_to_0x80000  [0x10000/4];

      //  App registers
      QABase   base;             // 0x80000
      uint32_t rsvd_to_0x80800  [(0x800-sizeof(QABase))/4];

      Mmcm     mmcm;             // 0x80800
      FmcCore  fmca_core;        // 0x81000
      AdcCore  adca_core;        // 0x81400
      //      FmcCore  fmcb_core;        // 0x81800
      FmcCoreVoid  fmcb_core;        // 0x81800
      AdcCore  adcb_core;        // 0x81C00
      AdcSync  adc_sync;         // 0x82000
      HdrFifo  hdr_fifo[4];      // 0x82800
      PhaseMsmt trg_phase[2];
      uint32_t rsvd_to_0x88000  [(0x5800-4*sizeof(HdrFifo)-2*sizeof(PhaseMsmt))/4];

      FexCfg   fex_chan[4];      // 0x88000
      uint32_t rsvd_to_0x90000  [(0x8000-4*sizeof(FexCfg))/4];

      //  Pgp (optional)  
      //      Pgp2bAxi pgp[4];           // 0x90000
      //      uint32_t pgp_fmc1;
      //      uint32_t pgp_fmc2;
      uint32_t pgp_reg[0x4000>>2];
      uint32_t auxStatus;
      uint32_t auxControl;
    };
  };
};

using namespace Pds::HSD;

Module* Module::create(int fd)
{
  void* ptr = mmap(0, sizeof(Pds::HSD::Module::PrivateData), PROT_READ|PROT_WRITE, MAP_SHARED, fd, 0);
  if (ptr == MAP_FAILED) {
    perror("Failed to map");
    return 0;
  }

  Pds::HSD::Module* m = new Pds::HSD::Module;
  m->p = reinterpret_cast<Pds::HSD::Module::PrivateData*>(ptr);
  m->_fd = fd;

  Pds::Mmhw::RegProxy::initialize(m->p, m->p->regProxy);

  return m;
}

Module* Module::create(int fd, TimingType timing)
{
  Module* m = create(fd);

  //
  //  Verify clock synthesizer is setup
  //
  if (timing != EXTERNAL) {
    timespec tvb;
